{
  "main": {
    "name":"Owen Parkins",
    "occupation":"Penetration Tester",
    "description":"Pen Tester. Software Developer. System Admin.",
    "image":"profilepic.webp",
    "bio":"I am a senior at New Mexico Institute of Mining and Technology pursing a bachelor and master of science in Computer Science with a focus in cybersecurity. My interests include rootkits, user authentication technologies, security audits, and software exploitation. When I am not working on cybersecurity related work, I am either reconfiguring servers at home, programming, dirt biking, or on a search and rescue mission.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "https://mailhide.io/e/p6gqY",
    "website": "https://oparkins.com",
    "contactInfo": "The best way to contact me is through email. Click the link below to retrieve my email address.",
    "social":[
      {
        "name":"github",
        "url":"http://github.com/oparkins",
        "className":"fa fa-github"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/owen-p-84b362b6/",
        "className":"fa fa-linkedin"
      }
    ]
  },
  "resume":{
    "objective": "I am seeking an internship to which I can apply my proven leadership and technical skills to. I am familiar with managing teams of various sizes and I specialize in security audits, software exploitation, and user authentication technologies.",
    "skillmessage":"I am success-oriented, self-motivated, and a natural leader with strong communication and presentation skills. I quickly adapt to new technology and changing project parameters.",
    "education":[
      {
        "school":"New Mexico Institute of Mining and Technology",
        "degree":"M.S. in Computer Science",
        "graduated":"Expected May 2020",
        "description":"Awards: Federal CyberCorps Scholarship for Service, Tech Scholar"
      },
      {
        "school":"New Mexico Institute of Mining and Technology",
        "degree":"B.S. in Computer Science",
        "graduated":"Expected May 2019",
        "description":"Awards: Federal CyberCorps Scholarship for Service, Tech Scholar, Presidential Scholarship, Legislative Lottery Scholarship"
      }
    ],
    "work":[
      {
        "company":"Idaho National Laboratory",
        "title":"Technical Intern",
        "years":"Summer 2018",
        "description": [
            "Developed attack vectors and completed preliminary analysis during a voting machine audit. Worked to explore potential attack vectors with team of cybersecurity researchers.",

            "Provided analysis of tools like Nmap and Ettercap to support the California Energy Systems for the 21st Century research efforts. The analysis included networking scanning tools on industrial control systems.",

            "Supported the dynamic line rating (DLR) project funded by the Wind Energy Technologies Office. Created a cybersecurity report detailing vulnerabilities and possible mitigations for the DLR solution."
          
        ]
      },
      {
        "company":"New Mexico Tech",
        "title":"Parallel Cluster System Administrator",
        "years":"January 2018 - Current",
        "description": [
            "Designed a cluster to use IPMI to manage physical nodes, provision with DigitalRebar, and deploy OpenStack through Kolla for the Secure System Administration class.",
            
            "Designed to run malware and be quarantined from external network connections."

        ]
      },
      {
        "company":"Earth and Environmental Science Department, New Mexico Tech",
        "title":"Software Engineer",
        "years":"October 2015 - Current",
        "description": [
            "Debugging a parallel 3D finite-element solver that couples groundwater flow, heat, and transport equations.",
            
            "Maintains multiple high performance computers. Provides regular updates and support for a multiple systems running different Linux and Windows operating systems.",
            
            "Inherited a previously developed software solution that calculates the density of water based on temperature and pressure. Converted the code from FORTRAN to MATLAB to use the solvers present in MATLAB. This enabled other faculty members to use the equation of state code in their own programs.",
            
            "Converted MATLAB code that calculated the stress on ice sheets to FORTRAN. This was to increase the speed of the calculations by decreasing the overhead of running the library in MATLAB."
        ]
      },
      {
        "company":"Ultramain Systems Incorporated",
        "title":"Software Engineer Intern",
        "years":"May 2017 - August 2017",
        "description": [
          "Worked with a team to migrate existing iOS application to the Universal Windows Platform. Created code generators written in Java to generate base entities in C#. Implemented platform-specific classes that supported the application"
        ]
      }
    ],
    "cyber_activities": 
      [
        {
          "title": "Security Audits",
          "years": "Spring 2016 - Current",
          "description": [
            "Performs network security audits for various organizations around New Mexico",

            "Audits include social engineering an organization’s employees, performing network scans and host discovery tasks, and creating remediation reports that detail the vulnerabilities found and possible actions to mitigate the issues"
          ]
        },
        {
          "title": "Department of Energy CyberForce Red Team",
          "years": "Spring 2016 - Current",
          "description": [
            "Participated with Sandia National Laboratories’ Red Team for the competition",

            "Duties included practicing exploits against various operating systems, preparing scripts for post-exploitation, and learning ICS vulnerabilities"
          ]
        },
        {
          "title": "NSA Codebreaker",
          "years": "Spring 2016 - Current",
          "description": [
            "Completed all tasks in the 2018 competition. Helped other students start several tasks and guide them through the competition.",

            "Participated in the 2016 competition and was offered a letter of recongnition from NSA"
          ]
        },
        {
          "title": "Wireless CTF",
          "years": "Spring 2016 - Current",
          "description": [
            "Participated in Idaho National Laboratory’s Wireless CTF Competition",

            "Practiced using aircrack-ng tool suite to defeat WEP and WPA2 protected networks"
          ]
        }
      ],
    "volunteering":
      [
        {
          "title": "Socorro Search and Rescue",
          "years": "January 2016 - Current",
          "description": "Vice President of the student-based team. Responsibilities consist of coordinating with State Police and supervising various school activities. Completed New Mexico’s State Certification for search and rescue and Operations Section Chief training"
        }
      ],
    "skills":
      [
        {
          "title": "Languages",
          "subtext": "C#, C++, C, Java, FORTRAN, MATLAB, Javascript, Ruby, Bash, Python, SQL, Assembly"
        },
        {
          "title": "Web Development",
          "subtext": "PHP, HTML, React, Ruby on Rails"
        },
        {
          "title": "Markup Languages",
          "subtext": "LaTeX"
        },
        {
          "title": "Development Tools",
          "subtext": "GNU Make, Visual Studio, Vim, Docker, Inno Setup Compiler, Jenkins CI, Microsoft Unit Test"
        },
        {
          "title": "Revision Control",
          "subtext": "git, Subversion"
        },
        {
          "title": "Microcontrollers",
          "subtext": "Arduino, Netduino, Raspberry Pi, Arbotix"
        },
        {
          "title": "Other",
          "subtext": "Computer hardware, Setting up and maintaining complex server systems, Kernel development (xv6)"
        }
      ],
      "projects": [
        {
          "title":"Sundial (Work In Progress)",
          "description":"Sundial is software designed to help manage time and tasks. It provides a simple user interface that enables users to keep on task throughout their day. Sundial will prioritize tasks so that the nearest deadline is at the top of the list. This application is continuously subjected to redesigns with new user interfaces and new libraries. Sundial is used as a testing ground for new technologies.",
          "url":"https://sundial.nibious.com"
        },
        {
          "title": "House Infrastructure",
          "description":"I am using Ubuntu (next time will be CentOS) as my base operating system and a hypervisor. I am using a virtualized pfSense as my router. pfSense provides DHCP, DNS, OpenVPN, and more services for my home network. On the same physical machine, connected via a virtual bridge, I use lxc containers for Unifi controller and Plex media server. I plan to use lxc containers to provide DHCP and DNS instead of using pfSense. This will allow the network to function if pfSense fails."
        },
        {
          "title": "1975 Honda CB200T Rebuild",
          "description": "I am working on my first motorcycle rebuild project. It is a 1975 Honda CB200T motorcycle. I am using this project to learn more about vehicle rebuilds. Currently, I am finishing the electrical system on the motorcycle."
        },
        {
          "title":"Reference Monitor with xv6 (Work In Progress)",
          "description":"xv6 is a unix-like that is used to teach operating systems. My semester project for the graduate level operating systems class is to implemenet a reference monitor within the xv6 operating system. This project is being completed this semester and I'll provide updates as more progress is completed.",
          "url":""
        },
        {
          "title":"AuctionBoost",
          "description":"AuctionBoost is software that is used for managing the check-in and check-out process at auctions. It enables organizations to provide quicker and more professional service to their guests. The software is capable of tracking guests and items throughout an auction. When guests first sign in on this software, they are given a bid card number as described by the auction's settings inside the software. When the guests check out, they can know what they bought right away – auctions no longer need to use other data sheet software to track their auction.",
          "url":""
        }
      ]
  }
}
